app/controllers/admin/access_controller.rb

  def index
    if !Preference.first
---
SELECT  "preferences".* FROM "preferences"  ORDER BY "preferences"."id" ASC LIMIT 1

  def update
    Preference.first.update(access_params)
---
UPDATE "preferences" SET "allow_create_songs" = ?, "allow_create_artists" = ?, "updated_at" = ? WHERE "preferences"."id" = ?  [["allow_create_songs", "f"], ["allow_create_artists", "t"], ["updated_at", "2016-02-02 00:17:49.602109"], ["id", 1]]